const questions=[
['配偶寫卡片、電子郵件、紙條向我示愛',1,'配偶與我擁抱',5],
['與配偶待在一處，就我們倆人',2,'配偶幫忙我做些事',4],
['配偶送禮物向我示愛',3,'配偶和我悠閒自在，不受打擾',2],
['沒想到，配偶幫我做了原本我該做的家務事',4,'配偶碰觸我',5],
['配偶在公開場合摟著我',5,'配偶送我禮物，給我帶來驚喜',3],
['就是喜歡與配偶在一起，哪怕什麼事都沒做',2,'與配偶牽手',5],
['配偶送我禮物',3,'配偶對我說「我愛你」',1],
['與配偶緊挨著坐',5,'沒特別原因，配偶就是讚賞我',1],
['與配偶外出閒逛',2,'出乎我意料之外，配偶送我禮物',3],
['聽到配偶對我說「我以你為傲！」',1,'配偶幫我做點事，減輕我的工作量',4],

['與配偶一起做點事，在一起的感覺真好',2,'配偶說話鼓勵我',1],
['配偶務實地替我做點事，不光是說說而已',4,'配偶與我擁抱',5],
['聽到配偶讚美我',1,'配偶真心在乎我，送我東西',3],
['抓住機會與配偶單獨相處',2,'配偶為我按摩背',5],
['配偶稱讚我的成就',1,'配偶幫我做一些連他自己都不喜歡做的事',4],
['配偶常親吻我',5,'配偶真的很關注我在乎的事',2],
['配偶以實際的行動幫我完成任務',4,'配偶送給我令我驚喜的禮物',3],
['配偶稱讚我的容貌',1,'配偶傾聽我說話並確實瞭解我的想法',2],
['與配偶在公開場合有「與性無關的碰觸」',5,'配偶為我跑腿',4],
['配偶替我做了非他分內該做的家務',4,'配偶花心思預備了禮物送給我',3],

['配偶專心與我說話，而不是老看手機',2,'配偶盡力幫著我做些事，減輕我工作上的壓力',4],
['我特別期待某個節日，因為知道配偶會送我禮物',3,'聽到配偶對我說「我很感激你」',1],
['配偶出差給我帶了小禮物',3,'配偶分擔我的工作，減輕我的壓力',4],
['配偶不打斷我說話',2,'在經營與配偶的關係上，「送禮物」對我而言很重要',3],
['配偶幫著我做事，因為知道我累了',4,'有機會和配偶到處走走',2],
['與配偶緊挨著',5,'在平凡的小日子裡，配偶精挑了件禮物送給我',3],
['配偶說話鼓勵我，給了我信心',1,'喜歡與配偶一起看電影',2],
['配偶送給我令我驚喜的禮物，表達對我的感謝',3,'在平凡的小日子裡，我和配偶有很多身體的碰觸',5],
['哪怕再忙，配偶還是伸手幫助我',4,'配偶明確地對我說「我欣賞你！」',1],
['小別後，配偶與我緊緊擁抱',5,'聽到配偶對我說「你對我太重要了！」',1]
];

const names={
  1:'肯定的言詞',
  2:'精心的時刻',
  3:'接受禮物',
  4:'服務的行動',
  5:'身體的接觸'
};

let i=0;

let s={
  1:0,
  2:0,
  3:0,
  4:0,
  5:0
};

function pick(type){
  s[type]++;
  i++;
  render();
}

function render(){

  if(i>=questions.length){

    const total=questions.length;

    const ranking=Object.entries(s)
      .sort((a,b)=>b[1]-a[1]);

    document.getElementById('app').innerHTML=`
      <div class="card result">

      <h2>測驗結果</h2>

      <table>
        <tr>
          <th>愛之語</th>
          <th>分數</th>
          <th>比例</th>
        </tr>

        ${Object.entries(s).map(([k,v])=>`
        <tr>
          <td>${names[k]}</td>
          <td>${v}</td>
          <td>${Math.round(v/total*100)}%</td>
        </tr>
        `).join('')}

      </table>

      <h3>你的主要愛之語</h3>

      <p class="winner">
      🏆 ${names[ranking[0][0]]}
      </p>

      <h3>排名</h3>

      <ol>
      ${ranking.map(([k,v])=>
        `<li>${names[k]}：${v}分</li>`
      ).join('')}
      </ol>

      <button onclick="location.reload()">
      重新測驗
      </button>

      </div>
    `;

    return;
  }

  const q=questions[i];

  const percent=Math.round(i/questions.length*100);

  document.getElementById('app').innerHTML=`

    <div class="card">

      <h2>單身愛之語測驗</h2>

      <div class="progress">
        <div class="bar" style="width:${percent}%"></div>
      </div>

      <p class="count">
      第 ${i+1} / ${questions.length} 題
      </p>

      <p class="question">
      哪一個陳述對你更有意義？
      </p>

      <button class="choice"
        onclick="pick(${q[1]})">
        ${q[0]}
      </button>

      <button class="choice"
        onclick="pick(${q[3]})">
        ${q[2]}
      </button>

    </div>
  `;
}

render();
